Revit 2026 API

# RevisionRevisionNumber Property

---

The Revision number of this revision.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RevisionNumber { get; }
```
```vb
Public ReadOnly Property RevisionNumber As String
	Get
```
```cpp
public:
property String^ RevisionNumber {
	String^ get ();
}
```
```fsharp
member RevisionNumber : string with get
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This operation is not valid for when the revision numbering is per sheet. |

Note that this field is only available if the RevisionSettings are set to number revisions PerProject. When Revisions are numbered PerSheet, a given Revision may display a different RevisionNumber on each sheet. In this case, the revision number can be obtained by calling [!:Autodesk::Revit::DB::ViewSheet::GetRevisionNumberOnSheet()].

#### Reference

Revision Class

Autodesk.Revit.DB Namespace